
<details><summary>Show Plan</summary>

``` terraform
terraform
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=494194448135757223]
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=2486594553883197905]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-641f6429]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=modl-sdk-upload]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=modl-sdk-analyzed]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/725604423866/modl-sdk-queue-deadletter]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-f2f246ad]
module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs: Refreshing state... [id=modl-sdk-analysis]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_upload]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:725604423866:certificate/691b9483-8679-4d94-82e4-c53a2ff634fc]
module.api.aws_iam_role.iam_for_lambda: Refreshing state... [id=modl-iam_for_lambda]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z03799832ACKUNJ8IZDHB]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-modl-server-access-logs]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio-modl.com]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=modl-sdk_analysis]
module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-c817d3b5]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-58d96f79]
module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:725604423866:cluster/modl-sdk_analysis-cluster]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=modl-sdk_analysis-execution-task-role]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=3333961761990155562]
module.api.aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=modl-iam_for_lambda-20210914183559514000000002]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=134254638304935216]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=E2E51DTG2P23PH]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=7741002650169314064]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=1966001569761004287]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/modl-sdk-upload-lambda]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_TXT]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio-modl.com"]: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__57b523665a1e9e3baef95f3dc85315ae.curibio-modl.com._CNAME]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_MX]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_862laeb5r7tfnxngc2mc_CNAME]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_www_CNAME]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_curibio-modl.com_A]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z03799832ACKUNJ8IZDHB__github-challenge-curibio.www.curibio.com_TXT]
module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=modl-sdk_analysis-execution-task-role-20210910222144615700000001]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=modl-sdk-upload-lambda]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-16 22:33:28 +0000 UTC]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_jupyter-sdk.curibio-modl.com_CNAME]
module.sdk_analysis.aws_sqs_queue.sdk_upload_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/725604423866/modl-sdk-upload-queue]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::725604423866:policy/modl-sdk-upload-lambda-inline]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio-modl.com]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=modl-sdk-upload-lambda-20210913232924341400000002]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=modl-sdk-upload-lambda-20210913232924355100000003]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role: Refreshing state... [id=modl-sdk_analysis-ecs_task_role]
module.sdk_analysis.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=modl-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=modl-sdk_analysis-ecs-task-definition]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1CI0FY7D89ZVE]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio-modl.com]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z03799832ACKUNJ8IZDHB_downloads.curibio-modl.com_CNAME]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.api.aws_apigatewayv2_api.example will be created
  + resource "aws_apigatewayv2_api" "example" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "modl-example"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.api.aws_apigatewayv2_integration.example will be created
  + resource "aws_apigatewayv2_integration" "example" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Lambda example"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:725604423866:function:modl-sdk-upload-lambda/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.example will be created
  + resource "aws_apigatewayv2_route" "example" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /example/{proxy+}"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_stage.example will be created
  + resource "aws_apigatewayv2_stage" "example" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "modl-example-stage"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.api.aws_cloudwatch_log_group.api_gw will be created
  + resource "aws_cloudwatch_log_group" "api_gw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "modl/aws/api_gw/modl-example"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "api-gw"
          + "Environment" = "modl"
        }
      + tags_all          = {
          + "Application" = "api-gw"
          + "Environment" = "modl"
        }
    }

  # module.api.aws_lambda_permission.lambda_permission will be created
  + resource "aws_lambda_permission" "lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "modl-sdk-upload-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowSDKUploadAPIInvoke"
    }

  # module.aurora_database.aws_db_parameter_group.parameter_group will be created
  + resource "aws_db_parameter_group" "parameter_group" {
      + arn         = (known after apply)
      + description = "modl-mantarray-rds-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "modl-mantarray-rds-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + tags_all    = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
    }

  # module.aurora_database.aws_default_subnet.default_subnet_a will be created
  + resource "aws_default_subnet" "default_subnet_a" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.aurora_database.aws_default_subnet.default_subnet_b will be created
  + resource "aws_default_subnet" "default_subnet_b" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = (known after apply)
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = (known after apply)
      + id                              = (known after apply)
      + ipv6_cidr_block                 = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = (known after apply)
      + owner_id                        = (known after apply)
      + tags_all                        = (known after apply)
      + vpc_id                          = (known after apply)
    }

  # module.aurora_database.aws_default_vpc.default_vpc will be created
  + resource "aws_default_vpc" "default_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = (known after apply)
      + cidr_block                       = (known after apply)
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = (known after apply)
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = (known after apply)
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags_all                         = (known after apply)
    }

  # module.aurora_database.aws_instance.ec2 will be created
  + resource "aws_instance" "ec2" {
      + ami                                  = "ami-087c17d1fe0178315"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "test_db_key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + tags_all                             = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # module.aurora_database.aws_key_pair.ec2 will be created
  + resource "aws_key_pair" "ec2" {
      + arn         = (known after apply)
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + key_name    = "test_db_key"
      + key_pair_id = (known after apply)
      + public_key  = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.aurora_database.aws_rds_cluster_parameter_group.cluster_parameter_group will be created
  + resource "aws_rds_cluster_parameter_group" "cluster_parameter_group" {
      + arn         = (known after apply)
      + description = "modl-mantarray-rds-cluster-parameter-group"
      + family      = "aurora-mysql5.7"
      + id          = (known after apply)
      + name        = "modl-mantarray-rds-cluster-parameter-group"
      + name_prefix = (known after apply)
      + tags        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + tags_all    = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
    }

  # module.aurora_database.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 3306
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 3306
            },
        ]
      + name                   = "rds_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + tags_all               = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + vpc_id                 = (known after apply)
    }

  # module.aurora_database.tls_private_key.test_db_key will be created
  + resource "tls_private_key" "test_db_key" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # module.aurora_database.module.rds.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn         = (known after apply)
      + description = "For Aurora cluster modl-mantarray-rds"
      + id          = (known after apply)
      + name        = "modl-mantarray-rds"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
          + "Name"        = "aurora-modl-mantarray-rds"
        }
      + tags_all    = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
          + "Name"        = "aurora-modl-mantarray-rds"
        }
    }

  # module.aurora_database.module.rds.aws_rds_cluster.this[0] will be created
  + resource "aws_rds_cluster" "this" {
      + allow_major_version_upgrade         = false
      + apply_immediately                   = true
      + arn                                 = (known after apply)
      + availability_zones                  = (known after apply)
      + backtrack_window                    = 0
      + backup_retention_period             = 7
      + cluster_identifier                  = "modl-mantarray-rds"
      + cluster_identifier_prefix           = (known after apply)
      + cluster_members                     = (known after apply)
      + cluster_resource_id                 = (known after apply)
      + copy_tags_to_snapshot               = false
      + database_name                       = (known after apply)
      + db_cluster_parameter_group_name     = (known after apply)
      + db_subnet_group_name                = "modl-mantarray-rds"
      + deletion_protection                 = false
      + enable_http_endpoint                = false
      + endpoint                            = (known after apply)
      + engine                              = "aurora-mysql"
      + engine_mode                         = "provisioned"
      + engine_version                      = "5.7.mysql_aurora.2.09.2"
      + engine_version_actual               = (known after apply)
      + final_snapshot_identifier           = (known after apply)
      + global_cluster_identifier           = ""
      + hosted_zone_id                      = (known after apply)
      + iam_database_authentication_enabled = false
      + iam_roles                           = (known after apply)
      + id                                  = (known after apply)
      + kms_key_id                          = (known after apply)
      + master_password                     = (sensitive value)
      + master_username                     = (sensitive)
      + port                                = 3306
      + preferred_backup_window             = "02:00-03:00"
      + preferred_maintenance_window        = "sun:05:00-sun:06:00"
      + reader_endpoint                     = (known after apply)
      + replication_source_identifier       = ""
      + skip_final_snapshot                 = true
      + source_region                       = ""
      + storage_encrypted                   = true
      + tags                                = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + tags_all                            = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + vpc_security_group_ids              = (known after apply)
    }

  # module.aurora_database.module.rds.aws_rds_cluster_instance.this[0] will be created
  + resource "aws_rds_cluster_instance" "this" {
      + apply_immediately               = true
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = (known after apply)
      + ca_cert_identifier              = "rds-ca-2019"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = false
      + db_parameter_group_name         = (known after apply)
      + db_subnet_group_name            = "modl-mantarray-rds"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-mysql"
      + engine_version                  = "5.7.mysql_aurora.2.09.2"
      + engine_version_actual           = (known after apply)
      + id                              = (known after apply)
      + identifier                      = "modl-mantarray-rds-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.t3.small"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 0
      + monitoring_role_arn             = (known after apply)
      + performance_insights_enabled    = false
      + performance_insights_kms_key_id = (known after apply)
      + port                            = (known after apply)
      + preferred_backup_window         = (known after apply)
      + preferred_maintenance_window    = "sun:05:00-sun:06:00"
      + promotion_tier                  = 1
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + tags_all                        = {
          + "Application" = "mantarray-rds"
          + "Environment" = "modl"
        }
      + writer                          = (known after apply)
    }

  # module.aurora_database.module.rds.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id" = "modl-mantarray-rds"
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = "arn:aws:ecs:us-east-1:725604423866:cluster/modl-sdk_analysis-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "modl-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-1:725604423866:task-definition/modl-sdk_analysis-ecs-task-definition:1"
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = [
              + "subnet-58d96f79",
              + "subnet-641f6429",
              + "subnet-f2f246ad",
            ]
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @luciipak